Revit 2027 API
FabricationPart.SetPartCustomDataInteger Method
 Set the custom data integer value for the specified custom data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPartCustomDataInteger(
	int customId,
	int value
)
Public Sub SetPartCustomDataInteger (
	customId As Integer,
	value As Integer
)
public:
void SetPartCustomDataInteger(
	int customId,
	int value
)
member SetPartCustomDataInteger :
        customId : int *
        value : int -> unit
Parameters
customId Int32
 The identifier of the custom data field to set.
value Int32
 The integer value of the custom data. If the data is not an integer type the value will be parsed according to the fabrication confifuration rules.
Exceptions
Exception | Condition
ArgumentException |  The custom data does not exist on the part.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace